{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source": {
				"Text": "(0 upgradeable)"
			},
			"Translation": {
				"Text": "(0 do ulepszenia)"
			},
			"Key": "3CEFA89C415D47DF87C953A4F5A22837"
		},
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "BE9D645D4352A41A16C3D0A5F1F62C94"
		},
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "F8E467094A594E5C21A542B94D14B1E6"
		},
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "3739407645161CDED5901EACEAEE5915"
		},
		{
			"Source": {
				"Text": "0"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "72BCC75B46EB14C88FA0CB8AFFE0ACFA"
		},
		{
			"Source": {
				"Text": "Adjust Current Axis"
			},
			"Translation": {
				"Text": "Dostosuj bieżącą oś"
			},
			"Key": "0F38693943C29DCD75F8C1B27871C5B8"
		},
		{
			"Source": {
				"Text": "Adjust Recipe"
			},
			"Translation": {
				"Text": "Dostosuj recepturę"
			},
			"Key": "FF3BF8944642F2DEE83E0685A53303EE"
		},
		{
			"Source": {
				"Text": "Adjust grid X-axis (forward/backward)"
			},
			"Translation": {
				"Text": "Dostosuj oś X siatki (przód/tył)"
			},
			"Key": "15E8B3EA40E8AC8A1E8E818BA03670E5"
		},
		{
			"Source": {
				"Text": "Adjust grid Y-axis (left/right)"
			},
			"Translation": {
				"Text": "Dostosuj oś Y siatki (lewo/prawo)"
			},
			"Key": "311FCC0E4AB23FE12C19BA94A560D1FB"
		},
		{
			"Source": {
				"Text": "Adjust grid Z-axis (up/down)"
			},
			"Translation": {
				"Text": "Dostosuj oś Z siatki (góra/dół)"
			},
			"Key": "ADFEA69944158AB689D01EB52BA2A425"
		},
		{
			"Source": {
				"Text": "Adjust sideways offset for grid items"
			},
			"Translation": {
				"Text": "Dostosuj przesunięcie boczne elementów siatki"
			},
			"Key": "7945CB1F4E10CE8044DCBF8DC47322E1"
		},
		{
			"Source": {
				"Text": "Adjust spacing for currently selected axis"
			},
			"Translation": {
				"Text": "Dostosuj odstęp dla aktualnie wybranej osi"
			},
			"Key": "F10D935E43878D99436DE5979A4E7EFD"
		},
		{
			"Source": {
				"Text": "Adjust step height for layers"
			},
			"Translation": {
				"Text": "Dostosuj wysokość stopnia dla warstw"
			},
			"Key": "4878AB2843890693F30F2BBA496DCCE8"
		},
		{
			"Source": {
				"Text": "Always (0)"
			},
			"Translation": {
				"Text": "Zawsze (0)"
			},
			"Key": "DFC6C7C441EFDC29C8E28F8F68C31EC1"
		},
		{
			"Source": {
				"Text": "Anchor: Aim at a belt, pipe, or pole"
			},
			"Translation": {
				"Text": "Kotwica: Wyceluj w taśmę, rurę lub słup"
			},
			"Key": "7C1BBA564FF13BA590D8A89C48E3F2C8"
		},
		{
			"Source": {
				"Text": "Auto"
			},
			"Translation": {
				"Text": "Auto"
			},
			"Key": "B7D7520E4A0B332ED9D87DBC994D5379"
		},
		{
			"Source": {
				"Text": "Auto"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "29B5665E4347B8A528480EA82ED201BE"
		},
		{
			"Source": {
				"Text": "Auto (0)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "40EADFF242CC6D8E10A4EDB6D777D2BC"
		},
		{
			"Source": {
				"Text": "Auto (0)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "9852395F409F9C751F989FA1748BFA16"
		},
		{
			"Source": {
				"Text": "Auto (0)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "A863449D4ED1EF98FD3531A57C03A83B"
		},
		{
			"Source": {
				"Text": "Auto 2D"
			},
			"Translation": {
				"Text": "Auto 2D"
			},
			"Key": "C24F4DC44DCA9C1FB249098A51A3B982"
		},
		{
			"Source": {
				"Text": "Auto 2D"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "A9F4FD7C4ADCBE49DE0631A2046B8C32"
		},
		{
			"Source": {
				"Text": "CANCEL"
			},
			"Translation": {
				"Text": "ANULUJ"
			},
			"Key": "9423B8A2450BD3341A377D9BD4CCD62B"
		},
		{
			"Source": {
				"Text": "Cancel"
			},
			"Translation": {
				"Text": "Anuluj"
			},
			"Key": "1754F7834BF1389234CDF2A4813856D4"
		},
		{
			"Source": {
				"Text": "Classic (2)"
			},
			"Translation": {
				"Text": "Klasyczny (2)"
			},
			"Key": "337DE321404C52EA519126A27AD16256"
		},
		{
			"Source": {
				"Text": "Close"
			},
			"Translation": {
				"Text": "Zamknij"
			},
			"Key": "CB15E1A74E71CFAEDB6CA3AA8994C227"
		},
		{
			"Source": {
				"Text": "Configure Smart! scaling, visualization, and HUD settings"
			},
			"Translation": {
				"Text": "Skonfiguruj skalowanie, wizualizację i ustawienia HUD Smart!"
			},
			"Key": "98E28A8E4D25D9D8BCD4C08EC6A98DE6"
		},
		{
			"Source": {
				"Text": "Core Smart! Foundations settings for HUD display and default scale values"
			},
			"Translation": {
				"Text": "Podstawowe ustawienia Smart! Foundations dla wyświetlania HUD i domyślnych wartości skali"
			},
			"Key": "FD8B2189447F09294CBA09A02293BB9C"
		},
		{
			"Source": {
				"Text": "Cross Splitters/Mergers"
			},
			"Translation": {
				"Text": "Przez rozdzielacze/łączniki"
			},
			"Key": "7A593AF64E9BB01288D106BC6229CBF9"
		},
		{
			"Source": {
				"Text": "Cross Storage Containers"
			},
			"Translation": {
				"Text": "Przez kontenery magazynowe"
			},
			"Key": "5938A49142B563B4FB59E985E9AE1841"
		},
		{
			"Source": {
				"Text": "Cross Train Platforms"
			},
			"Translation": {
				"Text": "Przez perony kolejowe"
			},
			"Key": "D042222F4CF5B96FB75D6AB15DFD0645"
		},
		{
			"Source": {
				"Text": "Curve"
			},
			"Translation": {
				"Text": "Łuk"
			},
			"Key": "60DE1CEC4B85C0CC72203CBF61E7568D"
		},
		{
			"Source": {
				"Text": "Curve"
			},
			"Translation": {
				"Text": "Łuk"
			},
			"Key": "C37B40874B51E0F5798841AA27981362"
		},
		{
			"Source": {
				"Text": "Curve"
			},
			"Translation": {
				"Text": "Łuk"
			},
			"Key": "2E5F43054D0239D4BAC0F4862CB459FB"
		},
		{
			"Source": {
				"Text": "Cycle Axis Mode"
			},
			"Translation": {
				"Text": "Przełącz tryb osi"
			},
			"Key": "348DAE9A4D32A65A01DF6A8106D161BC"
		},
		{
			"Source": {
				"Text": "Cycle through X → Y → Z axes"
			},
			"Translation": {
				"Text": "Przełączaj między osiami X → Y → Z"
			},
			"Key": "9C14E6F8447F242BFBB485BD8E31A5F3"
		},
		{
			"Source": {
				"Text": "Dark (1)"
			},
			"Translation": {
				"Text": "Ciemny (1)"
			},
			"Key": "15B881014DC7C163FCB1419FB255A0EC"
		},
		{
			"Source": {
				"Text": "Decrease value for active feature (scaling, spacing, steps, or stagger)"
			},
			"Translation": {
				"Text": "Zmniejsz wartość aktywnej funkcji (skalowanie, odstęp, stopnie lub przesunięcie)"
			},
			"Key": "3BECA57E4ACCC555B29B23AC5605DDCD"
		},
		{
			"Source": {
				"Text": "Default"
			},
			"Translation": {
				"Text": "Domyślny"
			},
			"Key": "D16C08E24764156DC1CBDAB0287C8627"
		},
		{
			"Source": {
				"Text": "Default (0)"
			},
			"Translation": {
				"Text": "Domyślny (0)"
			},
			"Key": "A6A1DA99437171CC3D6B8C9E2918CEE0"
		},
		{
			"Source": {
				"Text": "Detect Issues"
			},
			"Translation": {
				"Text": "Wykryj problemy"
			},
			"Key": "9C1531E24044FDC579C089A23F379274"
		},
		{
			"Source": {
				"Text": "Entire Map"
			},
			"Translation": {
				"Text": "Cała mapa"
			},
			"Key": "BE3FB1994C8451039886D1829DD59B06"
		},
		{
			"Source": {
				"Text": "Estimated Cost"
			},
			"Translation": {
				"Text": "Szacowany koszt"
			},
			"Key": "74176A6A4B5B3CE8A9A4BA8F752D804C"
		},
		{
			"Source": {
				"Text": "Estimated Cost"
			},
			"Translation": {
				"Text": "Szacowany koszt"
			},
			"Key": "173D524544632CCDED043A9E3F4F7CC3"
		},
		{
			"Source": {
				"Text": "Family Name Mk.1"
			},
			"Translation": {
				"Text": "Nazwa rodziny Mk.1"
			},
			"Key": "BEFE3D9D4EA76F0E2C34198C02E30A1E"
		},
		{
			"Source": {
				"Text": "Grid Total: 1 objects"
			},
			"Translation": {
				"Text": "Suma siatki: 1 obiektów"
			},
			"Key": "7ECCEB924559BAD3A1844C80D4581EAE"
		},
		{
			"Source": {
				"Text": "HUD Scale"
			},
			"Translation": {
				"Text": "Skala HUD"
			},
			"Key": "9E038900477F0B65A5A64E91AB5C00F0"
		},
		{
			"Source": {
				"Text": "High Contrast (3)"
			},
			"Translation": {
				"Text": "Wysoki kontrast (3)"
			},
			"Key": "0B68620A45C29BCF2BD3D390E9C6440C"
		},
		{
			"Source": {
				"Text": "Hold to activate progressive layering (modifier key)"
			},
			"Translation": {
				"Text": "Przytrzymaj, aby aktywować progresywne warstwy (klawisz modyfikujący)"
			},
			"Key": "93C024D64433A5447D2C0396B3C5CB33"
		},
		{
			"Source": {
				"Text": "Hold to activate rotation transform mode (modifier key)"
			},
			"Translation": {
				"Text": "Przytrzymaj, aby aktywować tryb obrotu (klawisz modyfikujący)"
			},
			"Key": "2B909A3E4443898FEB06568A0618C52A"
		},
		{
			"Source": {
				"Text": "Hold to activate sideways offset (modifier key)"
			},
			"Translation": {
				"Text": "Przytrzymaj, aby aktywować przesunięcie boczne (klawisz modyfikujący)"
			},
			"Key": "E7D5F1A145882159A49EE89DEAA01EF5"
		},
		{
			"Source": {
				"Text": "Hold to activate spacing (modifier key)"
			},
			"Translation": {
				"Text": "Przytrzymaj, aby aktywować odstęp (klawisz modyfikujący)"
			},
			"Key": "2878874049B6D5EE0A5D6D9B48259F72"
		},
		{
			"Source": {
				"Text": "Hold to scale X-axis. Combine with Y modifier to scale Z-axis."
			},
			"Translation": {
				"Text": "Przytrzymaj, aby skalować oś X. Połącz z modyfikatorem Y, aby skalować oś Z."
			},
			"Key": "9AE7D23346D4BB5B0192848D8291920C"
		},
		{
			"Source": {
				"Text": "Hold to scale Y-axis. Combine with X modifier to scale Z-axis."
			},
			"Translation": {
				"Text": "Przytrzymaj, aby skalować oś Y. Połącz z modyfikatorem X, aby skalować oś Z."
			},
			"Key": "FA69B4C54C1F9AC00819708F1BD00666"
		},
		{
			"Source": {
				"Text": "Horiz→Vert"
			},
			"Translation": {
				"Text": "Poz→Pion"
			},
			"Key": "A70A70BC46CB9221B4A7618D9D344FCD"
		},
		{
			"Source": {
				"Text": "Horiz→Vert"
			},
			"Translation": {
				"Text": "Poz→Pion"
			},
			"Key": "E0D5AEF140C1253876F13FB56301E909"
		},
		{
			"Source": {
				"Text": "Hypertube Auto-Connect:"
			},
			"Translation": {
				"Text": "Automatyczne łączenie Hypertube:"
			},
			"Key": "7D70E1B54E59E0072AA18581782CA4A0"
		},
		{
			"Source": {
				"Text": "Increase value for active feature (scaling, spacing, steps, or stagger)"
			},
			"Translation": {
				"Text": "Zwiększ wartość aktywnej funkcji (skalowanie, odstęp, stopnie lub przesunięcie)"
			},
			"Key": "1BCE444B43095B0D655193A1B416CBBD"
		},
		{
			"Source": {
				"Text": "Large Grid Warning"
			},
			"Translation": {
				"Text": "Ostrzeżenie: Duża siatka"
			},
			"Key": "33C84A48437DD1E5D1CF0AAD223DC813"
		},
		{
			"Source": {
				"Text": "Minimal (4)"
			},
			"Translation": {
				"Text": "Minimalny (4)"
			},
			"Key": "A08F54F64F8642B9E7F8F1AA30D2B869"
		},
		{
			"Source": {
				"Text": "Mk1 (1)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "B67A2B1049D6C022FFE45AA3C7E91E0D"
		},
		{
			"Source": {
				"Text": "Mk1 (1)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "80ADD8BF4E442F2608D92FB8ECD49CC2"
		},
		{
			"Source": {
				"Text": "Mk2 (2)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "7A7B62144F20B0B73ABCD8B643EED6A1"
		},
		{
			"Source": {
				"Text": "Mk2 (2)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "6587C0CB460666BD6FC98BB018890DC5"
		},
		{
			"Source": {
				"Text": "Mk3 (3)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "438320444C8158C55C66F08F8D53EBD5"
		},
		{
			"Source": {
				"Text": "Mk4 (4)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "C0E174744867FC71F8E879B5AE7D69EE"
		},
		{
			"Source": {
				"Text": "Mk5 (5)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "C08F8647484002CCC38A78938534A251"
		},
		{
			"Source": {
				"Text": "Mk6 (6)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "31D1020F4EA86C6B0532A3916E9533CD"
		},
		{
			"Source": {
				"Text": "Monochrome (5)"
			},
			"Translation": {
				"Text": "Monochromatyczny (5)"
			},
			"Key": "8E24BA32430E1A670137ABA048747BB8"
		},
		{
			"Source": {
				"Text": "Network"
			},
			"Translation": {
				"Text": "Sieć"
			},
			"Key": "09B266E74168D79CC01A54B6220782CC"
		},
		{
			"Source": {
				"Text": "Never (2)"
			},
			"Translation": {
				"Text": "Nigdy (2)"
			},
			"Key": "E9350DEF466B0A2E9F7FBDB9FA947A97"
		},
		{
			"Source": {
				"Text": "Noodle"
			},
			"Translation": {
				"Text": "Makaron"
			},
			"Key": "928114D446D78C041AEF5D88157821E9"
		},
		{
			"Source": {
				"Text": "Noodle"
			},
			"Translation": {
				"Text": "Makaron"
			},
			"Key": "2BBD2D8A4804BE82F72DB0B091876974"
		},
		{
			"Source": {
				"Text": "Not saved"
			},
			"Translation": {
				"Text": "Nie zapisano"
			},
			"Key": "CDF7639140F228F3095085B61DF1FC1A"
		},
		{
			"Source": {
				"Text": "Once (1)"
			},
			"Translation": {
				"Text": "Raz (1)"
			},
			"Key": "A1723C3742687518D3D7FAB8769C4F43"
		},
		{
			"Source": {
				"Text": "Press REFRESH to scan for upgradeable buildings. Press ESC or K to close."
			},
			"Translation": {
				"Text": "Naciśnij ODŚWIEŻ, aby przeskanować budynki do ulepszenia. Naciśnij ESC lub K, aby zamknąć."
			},
			"Key": "66C35E014DB7009BE3B924A85F570FD7"
		},
		{
			"Source": {
				"Text": "Press to clear active recipe"
			},
			"Translation": {
				"Text": "Naciśnij, aby wyczyścić aktywną recepturę"
			},
			"Key": "790FF28E4D98D951C6AE27B8A147F50F"
		},
		{
			"Source": {
				"Text": "REFRESH"
			},
			"Translation": {
				"Text": "ODŚWIEŻ"
			},
			"Key": "1CBF9AC24AB88ED704D8B89C23669BF7"
		},
		{
			"Source": {
				"Text": "Radius"
			},
			"Translation": {
				"Text": "Promień"
			},
			"Key": "1CBE81654BEC06C4EE4D2F9B77C6823C"
		},
		{
			"Source": {
				"Text": "Radius (m):"
			},
			"Translation": {
				"Text": "Promień (m):"
			},
			"Key": "32F87FF84A2C859EEF06EDA73BD50D90"
		},
		{
			"Source": {
				"Text": "Ready"
			},
			"Translation": {
				"Text": "Gotowe"
			},
			"Key": "FD2BEAF2493FD288E0C03FB923FE3E94"
		},
		{
			"Source": {
				"Text": "Recipe Mode"
			},
			"Translation": {
				"Text": "Tryb receptury"
			},
			"Key": "310A5EFE4224B829F9BA469562A68951"
		},
		{
			"Source": {
				"Text": "Recipe Up/Down"
			},
			"Translation": {
				"Text": "Receptura góra/dół"
			},
			"Key": "F87C5DEE489864EDB5D02386C86E62CF"
		},
		{
			"Source": {
				"Text": "Repair All Issues"
			},
			"Translation": {
				"Text": "Napraw wszystkie problemy"
			},
			"Key": "70622324402CD200612E9395164CE150"
		},
		{
			"Source": {
				"Text": "Repair result will appear here"
			},
			"Translation": {
				"Text": "Wynik naprawy pojawi się tutaj"
			},
			"Key": "C6DDD93A4DEF142BBA1E08BBE2381F1B"
		},
		{
			"Source": {
				"Text": "Rotation Mode"
			},
			"Translation": {
				"Text": "Tryb obrotu"
			},
			"Key": "E3CA9AD8424D9B1B3B996C97C1F70A61"
		},
		{
			"Source": {
				"Text": "Route mouse wheel input to the active Smart! feature (scaling, spacing, steps, or stagger)"
			},
			"Translation": {
				"Text": "Kieruj wejście kółka myszy do aktywnej funkcji Smart! (skalowanie, odstęp, stopnie lub przesunięcie)"
			},
			"Key": "FA953BD649A5AEE3F69CB7AFE9E2A43A"
		},
		{
			"Source": {
				"Text": "Routing:"
			},
			"Translation": {
				"Text": "Trasowanie:"
			},
			"Key": "F9CB428247FA00F2916066950E42FA87"
		},
		{
			"Source": {
				"Text": "Run Detect to see results"
			},
			"Translation": {
				"Text": "Uruchom Wykryj, aby zobaczyć wyniki"
			},
			"Key": "96E044FE4DDABD241B0483A89D209A2C"
		},
		{
			"Source": {
				"Text": "SCAN NETWORK"
			},
			"Translation": {
				"Text": "SKANUJ SIEĆ"
			},
			"Key": "827BDCB04E7D02296EA3E880D6C24DC3"
		},
		{
			"Source": {
				"Text": "Save New Preset"
			},
			"Translation": {
				"Text": "Zapisz nowy zestaw"
			},
			"Key": "DD0B98B04A427071B009D7BAA464B531"
		},
		{
			"Source": {
				"Text": "Scale Forward/Back"
			},
			"Translation": {
				"Text": "Skaluj przód/tył"
			},
			"Key": "7F2E5ED1421D2CB422D39B96E7FEFA25"
		},
		{
			"Source": {
				"Text": "Scale Left/Right"
			},
			"Translation": {
				"Text": "Skaluj lewo/prawo"
			},
			"Key": "A65B455D41D3967FE018129E6F8D99BC"
		},
		{
			"Source": {
				"Text": "Scale Up/Down"
			},
			"Translation": {
				"Text": "Skaluj góra/dół"
			},
			"Key": "D62D58CF4AFE88D8DE519488D31F424F"
		},
		{
			"Source": {
				"Text": "Scale X Modifier"
			},
			"Translation": {
				"Text": "Modyfikator skalowania X"
			},
			"Key": "B433CC5C466EDDBF3105FA829F9B12D5"
		},
		{
			"Source": {
				"Text": "Scale Y Modifier"
			},
			"Translation": {
				"Text": "Modyfikator skalowania Y"
			},
			"Key": "FECC44E2411C81715010F7B2FAD081E6"
		},
		{
			"Source": {
				"Text": "Scan"
			},
			"Translation": {
				"Text": "Skanuj"
			},
			"Key": "1322786544407AA4F8ED1B8190F76D9F"
		},
		{
			"Source": {
				"Text": "Scan network to see costs"
			},
			"Translation": {
				"Text": "Zeskanuj sieć, aby zobaczyć koszty"
			},
			"Key": "E66C9E5840CD757371D1B2A26B0937F7"
		},
		{
			"Source": {
				"Text": "Select items to see costs"
			},
			"Translation": {
				"Text": "Wybierz elementy, aby zobaczyć koszty"
			},
			"Key": "9E972DC647E3D424CFE890B235FB1EE3"
		},
		{
			"Source": {
				"Text": "Share"
			},
			"Translation": {
				"Text": "Udostępnij"
			},
			"Key": "6B9892D145A9E8A2054CEBAEF0A6B4E5"
		},
		{
			"Source": {
				"Text": "Show Direction Arrows (can be overridden)"
			},
			"Translation": {
				"Text": "Pokaż strzałki kierunku (można nadpisać)"
			},
			"Key": "EA82618C44B70702397E7E97036E946B"
		},
		{
			"Source": {
				"Text": "Show/hide axis direction arrows"
			},
			"Translation": {
				"Text": "Pokaż/ukryj strzałki kierunku osi"
			},
			"Key": "78E37EDB4BEB48A04A5139AC6A0C614D"
		},
		{
			"Source": {
				"Text": "Smart Restore"
			},
			"Translation": {
				"Text": "Smart! Przywracanie"
			},
			"Key": "F506AD1F41CF8A81A27FC0A480EAE8B8"
		},
		{
			"Source": {
				"Text": "Smart! Configuration"
			},
			"Translation": {
				"Text": "Smart! Konfiguracja"
			},
			"Key": "7BAE3F3D4FEAEB14DC15CCBAC6FA6820"
		},
		{
			"Source": {
				"Text": "Smart! Foundations"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "97E5935349503B2191BFE4B385BC7AB3"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Skalowanie siatki"
			},
			"Key": "51EB9D9A495D641249A89FA0BD6F76B3"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Skalowanie siatki"
			},
			"Key": "53A77D7341E0BB96E67D9287BEF26C24"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Skalowanie siatki"
			},
			"Key": "62C6E10A41335FE94A371DB0EA31B799"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Skalowanie siatki"
			},
			"Key": "B4E7FC1B4C29E5780A005DACF4F6605B"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Skalowanie siatki"
			},
			"Key": "331CFA504EADB43C56B9C1AF41012E2F"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Skalowanie siatki"
			},
			"Key": "B8C9B67949C7644C3AE6519EBC26464D"
		},
		{
			"Source": {
				"Text": "Smart! Interface"
			},
			"Translation": {
				"Text": "Smart! Interfejs"
			},
			"Key": "F484CB0045E1F6610752E19D98C01DFE"
		},
		{
			"Source": {
				"Text": "Smart! Panel"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "466E938E4AA5B443D005619DEB8F0382"
		},
		{
			"Source": {
				"Text": "Smart! Recipe"
			},
			"Translation": {
				"Text": "Smart! Receptura"
			},
			"Key": "86A78F2C47F34655E5C58484EC93E3AD"
		},
		{
			"Source": {
				"Text": "Smart! Recipe"
			},
			"Translation": {
				"Text": "Smart! Receptura"
			},
			"Key": "1C0157F7400B84FCEA0CB0997F18ECFA"
		},
		{
			"Source": {
				"Text": "Smart! Rotation"
			},
			"Translation": {
				"Text": "Smart! Obrót"
			},
			"Key": "E522B9984A797E90FDF435B93981833C"
		},
		{
			"Source": {
				"Text": "Smart! Spacing"
			},
			"Translation": {
				"Text": "Smart! Odstęp"
			},
			"Key": "1D5643D5431C6F63F8A943BCE13CBE7E"
		},
		{
			"Source": {
				"Text": "Smart! Spacing"
			},
			"Translation": {
				"Text": "Smart! Odstęp"
			},
			"Key": "246236E4495CCCF2A3E4FC85C85DA9AB"
		},
		{
			"Source": {
				"Text": "Smart! Spacing"
			},
			"Translation": {
				"Text": "Smart! Odstęp"
			},
			"Key": "12DA0489426F414A397D0589ED6C0745"
		},
		{
			"Source": {
				"Text": "Smart! Stagger"
			},
			"Translation": {
				"Text": "Smart! Przesunięcie"
			},
			"Key": "5162B61A422973421A9B5084A1B41030"
		},
		{
			"Source": {
				"Text": "Smart! Stagger"
			},
			"Translation": {
				"Text": "Smart! Przesunięcie"
			},
			"Key": "F5885ED64196DAF6BE5F878ED0AF0A29"
		},
		{
			"Source": {
				"Text": "Smart! Steps"
			},
			"Translation": {
				"Text": "Smart! Stopnie"
			},
			"Key": "63AABDCD482973D2CAFDF2932D97AE25"
		},
		{
			"Source": {
				"Text": "Smart! Steps"
			},
			"Translation": {
				"Text": "Smart! Stopnie"
			},
			"Key": "067E1A5040E18EA163524F8F205335A9"
		},
		{
			"Source": {
				"Text": "Smart! Upgrade Panel"
			},
			"Translation": {
				"Text": "Smart! Panel ulepszeń"
			},
			"Key": "8BB84C5240D8A57F87983A986C3DFB73"
		},
		{
			"Source": {
				"Text": "Spacing Mode"
			},
			"Translation": {
				"Text": "Tryb odstępu"
			},
			"Key": "9643BBEF4D4BFEB216B5CDB73AC1A4C8"
		},
		{
			"Source": {
				"Text": "Stagger Left/Right"
			},
			"Translation": {
				"Text": "Przesunięcie lewo/prawo"
			},
			"Key": "6F0E40FD4B11CA1CEC6FC5B06EB0188C"
		},
		{
			"Source": {
				"Text": "Stagger Mode"
			},
			"Translation": {
				"Text": "Tryb przesunięcia"
			},
			"Key": "AC9521FE4F1ABB4F0FDA12BE408820F6"
		},
		{
			"Source": {
				"Text": "Steps Mode"
			},
			"Translation": {
				"Text": "Tryb stopni"
			},
			"Key": "A4625ACE4A31BA74C187C09C62723BE6"
		},
		{
			"Source": {
				"Text": "Steps Up/Down"
			},
			"Translation": {
				"Text": "Stopnie góra/dół"
			},
			"Key": "E148F27C4C01935B4E019BA49F4A0F55"
		},
		{
			"Source": {
				"Text": "Straight"
			},
			"Translation": {
				"Text": "Prosta"
			},
			"Key": "7D33892C463173CDF05A0383D92017C8"
		},
		{
			"Source": {
				"Text": "Straight"
			},
			"Translation": {
				"Text": "Prosta"
			},
			"Key": "8A7DD44D47B48C266B3B88AC01D1CEF3"
		},
		{
			"Source": {
				"Text": "Straight"
			},
			"Translation": {
				"Text": "Prosta"
			},
			"Key": "0019837C427C49F6BA1DE5A2BAF52104"
		},
		{
			"Source": {
				"Text": "Target Tier:"
			},
			"Translation": {
				"Text": "Docelowy poziom:"
			},
			"Key": "C34C1A5F452AB8290A9A00BA9D73780D"
		},
		{
			"Source": {
				"Text": "Target Tier:"
			},
			"Translation": {
				"Text": "Docelowy poziom:"
			},
			"Key": "47FABC9743E900C118B8FCAF9C9076DE"
		},
		{
			"Source": {
				"Text": "These tools diagnose and repair conveyor chain corruption. Only use them if you are experiencing belt issues."
			},
			"Translation": {
				"Text": "Te narzędzia diagnozują i naprawiają uszkodzenia łańcuchów przenośników. Używaj ich tylko, gdy masz problemy z taśmami."
			},
			"Key": "427A62BA4B691763413124A521EE7AA2"
		},
		{
			"Source": {
				"Text": "Toggle Arrows"
			},
			"Translation": {
				"Text": "Przełącz strzałki"
			},
			"Key": "3326E4B341828CD7663F6285E104A803"
		},
		{
			"Source": {
				"Text": "Toggle Settings Form"
			},
			"Translation": {
				"Text": "Przełącz formularz ustawień"
			},
			"Key": "3E62D33F4FA4C52320AB48BD9B6D8B1C"
		},
		{
			"Source": {
				"Text": "Toggle Smart Settings Form"
			},
			"Translation": {
				"Text": "Przełącz formularz ustawień Smart"
			},
			"Key": "D09E94C0499C4C4F3E606D9E2461B19A"
		},
		{
			"Source": {
				"Text": "Triage"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "D5988C104C18248A9BFD8485A40BE7BF"
		},
		{
			"Source": {
				"Text": "UPGRADE"
			},
			"Translation": {
				"Text": "ULEPSZ"
			},
			"Key": "0A60D4B54D01B286CA22F0A0967B6803"
		},
		{
			"Source": {
				"Text": "Warning message here"
			},
			"Translation": {
				"Text": "Komunikat ostrzegawczy tutaj"
			},
			"Key": "BB16B38F4773E62C787CD8A7A950B2A0"
		},
		{
			"Source": {
				"Text": "X"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "1926932648C4B2B04FFA2DA78759EB8A"
		},
		{
			"Source": {
				"Text": "X (1)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "59B517F844E13DA8F3D539844F2C9378"
		},
		{
			"Source": {
				"Text": "X+Y (3)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "56027A5C460D5844EF237AB48DAA5A28"
		},
		{
			"Source": {
				"Text": "Y (2)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "444B8B2648F771FC835D1CABC302BA9E"
		},
		{
			"Source": {
				"Text": "°"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "23C90C2D418545EC4333738F056A5EE6"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "SmartFoundations",
			"Children": [
				{
					"Source": {
						"Text": " x "
					},
					"Translation": {
						"Text": " x "
					},
					"Key": "Upgrade_Separator"
				},
				{
					"Source": {
						"Text": "# of Connections to Keep Free:"
					},
					"Translation": {
						"Text": "Zarezerwowane połączenia:"
					},
					"Key": "Config_PowerReserved"
				},
				{
					"Source": {
						"Text": "(No net cost)"
					},
					"Translation": {
						"Text": "(Brak kosztów netto)"
					},
					"Key": "Upgrade_NoNetCost"
				},
				{
					"Source": {
						"Text": "({0} upgradeable)"
					},
					"Translation": {
						"Text": "({0} do ulepszenia)"
					},
					"Key": "Upgrade_UpgradeableCount"
				},
				{
					"Source": {
						"Text": "* Extreme grid - high risk of freeze/crash"
					},
					"Translation": {
						"Text": "* Ekstremalna siatka — wysokie ryzyko zawieszenia/awarii"
					},
					"Key": "Panel_GridWarning_Danger"
				},
				{
					"Source": {
						"Text": "* Large grid"
					},
					"Translation": {
						"Text": "* Duża siatka"
					},
					"Key": "Panel_GridWarning_Caution"
				},
				{
					"Source": {
						"Text": "* Very large grid - may cause temporary freeze"
					},
					"Translation": {
						"Text": "* Bardzo duża siatka — może spowodować tymczasowe zawieszenie"
					},
					"Key": "Panel_GridWarning_Warning"
				},
				{
					"Source": {
						"Text": "*Auto-Connect Disabled (double-tap to re-enable)"
					},
					"Translation": {
						"Text": "*Automatyczne połączenie wyłączone (podwójne naciśnięcie aby włączyć)"
					},
					"Key": "HUD_AutoConnectDisabled"
				},
				{
					"Source": {
						"Text": "*Extend Active"
					},
					"Translation": {
						"Text": "*Rozszerzenie aktywne"
					},
					"Key": "HUD_ExtendActive"
				},
				{
					"Source": {
						"Text": "*Extend Disabled"
					},
					"Translation": {
						"Text": "*Rozszerzenie wyłączone"
					},
					"Key": "HUD_ExtendDisabled"
				},
				{
					"Source": {
						"Text": "*Extend: {0}x{1}"
					},
					"Translation": {
						"Text": "*Rozszerzenie: {0}x{1}"
					},
					"Key": "HUD_ExtendScaled"
				},
				{
					"Source": {
						"Text": "*Restore Active"
					},
					"Translation": {
						"Text": "*Przywracanie aktywne"
					},
					"Key": "HUD_RestoreActive"
				},
				{
					"Source": {
						"Text": "*Restore: {0}"
					},
					"Translation": {
						"Text": "*Przywracanie: {0}"
					},
					"Key": "HUD_RestorePreset"
				},
				{
					"Source": {
						"Text": "*Smart: Scaling only (double-tap to re-enable)"
					},
					"Translation": {
						"Text": "*Smart: Tylko skalowanie (podwójne naciśnięcie aby włączyć)"
					},
					"Key": "HUD_SmartDisabled"
				},
				{
					"Source": {
						"Text": "*Walk  {0} seg | head {1} {2}deg | {3}"
					},
					"Translation": {
						"Text": "*Chodzenie  {0} seg | kurs {1} {2}deg | {3}"
					},
					"Key": "HUD_Walk"
				},
				{
					"Source": {
						"Text": "*Zoop Active - Scaling Disabled"
					},
					"Translation": {
						"Text": "*Zoop aktywny — Skalowanie wyłączone"
					},
					"Key": "HUD_ZoopActive"
				},
				{
					"Source": {
						"Text": "A preset named '{0}' already exists. Overwrite?"
					},
					"Translation": {
						"Text": "Zestaw o nazwie '{0}' już istnieje. Nadpisać?"
					},
					"Key": "Panel_Restore_OverwriteMessage"
				},
				{
					"Source": {
						"Text": "Advance m"
					},
					"Translation": {
						"Text": "Naprzód m"
					},
					"Key": "Walk_Col_Advance"
				},
				{
					"Source": {
						"Text": "Advance{0}: {1}m"
					},
					"Translation": {
						"Text": "Naprzód{0}: {1}m"
					},
					"Key": "HUD_WalkAdvance"
				},
				{
					"Source": {
						"Text": "Aim at a belt, pipe, or pole to scan its network"
					},
					"Translation": {
						"Text": "Wyceluj w taśmę, rurę lub słup, aby zeskanować sieć"
					},
					"Key": "Upgrade_TraversalHint"
				},
				{
					"Source": {
						"Text": "Aim at a belt, pipe, or power pole to scan its network"
					},
					"Translation": {
						"Text": "Wyceluj w taśmę, rurę lub słup energetyczny, aby przeskanować sieć"
					},
					"Key": "Upgrade_AimAtTarget"
				},
				{
					"Source": {
						"Text": "Aim at a buildable and press Scan Network"
					},
					"Translation": {
						"Text": "Wyceluj w budynek i naciśnij Skanuj sieć"
					},
					"Key": "Upgrade_AimAndScan"
				},
				{
					"Source": {
						"Text": "Allow auto-connected belts to stack vertically where they overlap."
					},
					"Translation": {
						"Text": "Pozwól automatycznie łączonym taśmom piętrować się pionowo tam, gdzie się nakładają."
					},
					"Key": "P.bStackableBeltEnabled.TT"
				},
				{
					"Source": {
						"Text": "Anchor: {0} (Mk{1})"
					},
					"Translation": {
						"Text": "Kotwica: {0} (Mk{1})"
					},
					"Key": "Upgrade_Anchor"
				},
				{
					"Source": {
						"Text": "Animate the arrows orbiting the hologram. Turn off for static arrows that still track you."
					},
					"Translation": {
						"Text": "Animuj strzałki orbitujące wokół hologramu. Wyłącz dla statycznych strzałek, które nadal cię śledzą."
					},
					"Key": "P.bShowArrowOrbit.TT"
				},
				{
					"Source": {
						"Text": "Apply"
					},
					"Translation": {
						"Text": "Zastosuj"
					},
					"Key": "Panel_Btn_ApplyPreset"
				},
				{
					"Source": {
						"Text": "Apply"
					},
					"Translation": {
						"Text": "Zastosuj"
					},
					"Key": "Panel_Btn_Apply"
				},
				{
					"Source": {
						"Text": "Apply Immediately"
					},
					"Translation": {
						"Text": "Zastosuj natychmiast"
					},
					"Key": "Config_ApplyImmediate"
				},
				{
					"Source": {
						"Text": "Apply Immediately"
					},
					"Translation": {
						"Text": "Zastosuj natychmiast"
					},
					"Key": "P.bApplyImmediately"
				},
				{
					"Source": {
						"Text": "Apply Immediately:"
					},
					"Translation": {
						"Text": "Zastosuj natychmiast:"
					},
					"Key": "Panel_ApplyImmediately"
				},
				{
					"Source": {
						"Text": "Apply Smart Panel changes instantly instead of clicking the Apply button."
					},
					"Translation": {
						"Text": "Stosuj zmiany Smart Panel natychmiast zamiast klikać przycisk Zastosuj."
					},
					"Key": "P.bApplyImmediately.TT"
				},
				{
					"Source": {
						"Text": "Arrow Axis Labels"
					},
					"Translation": {
						"Text": "Etykiety osi strzałek"
					},
					"Key": "P.bShowArrowLabels"
				},
				{
					"Source": {
						"Text": "Arrow Axis Labels:"
					},
					"Translation": {
						"Text": "Etykiety osi strzałek:"
					},
					"Key": "Config_ArrowLabels"
				},
				{
					"Source": {
						"Text": "Arrow Orbit Animation"
					},
					"Translation": {
						"Text": "Animacja orbity strzałek"
					},
					"Key": "P.bShowArrowOrbit"
				},
				{
					"Source": {
						"Text": "Arrow Orbit Animation:"
					},
					"Translation": {
						"Text": "Animacja orbity strzałek:"
					},
					"Key": "Config_ArrowOrbit"
				},
				{
					"Source": {
						"Text": "Arrows"
					},
					"Translation": {
						"Text": "Strzałki"
					},
					"Key": "Sec.Arrows"
				},
				{
					"Source": {
						"Text": "Audit Complete: {0} upgradeable found across {1} structures."
					},
					"Translation": {
						"Text": "Audyt zakończony: {0} ulepszalnych znalezionych w {1} strukturach."
					},
					"Key": "Upgrade_AuditComplete"
				},
				{
					"Source": {
						"Text": "Audit failed or was canceled."
					},
					"Translation": {
						"Text": "Audyt nie powiódł się lub został anulowany."
					},
					"Key": "Upgrade_AuditFailed"
				},
				{
					"Source": {
						"Text": "Auditing world... {0}% ({1} scanned)"
					},
					"Translation": {
						"Text": "Audyt świata... {0}% ({1} przeskanowanych)"
					},
					"Key": "Upgrade_AuditProgress"
				},
				{
					"Source": {
						"Text": "Auto"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Walk_Opt_Auto"
				},
				{
					"Source": {
						"Text": "Auto 2D"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Walk_Opt_Auto2D"
				},
				{
					"Source": {
						"Text": "Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne połączenie"
					},
					"Key": "Panel_AutoConnectHeader"
				},
				{
					"Source": {
						"Text": "Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie"
					},
					"Key": "Panel_Restore_CaptureAutoConnect"
				},
				{
					"Source": {
						"Text": "Auto-Hold on Grid Change"
					},
					"Translation": {
						"Text": "Auto-blokada przy zmianie siatki"
					},
					"Key": "P.bAutoHoldOnGridChange"
				},
				{
					"Source": {
						"Text": "Auto-Hold on Grid Change:"
					},
					"Translation": {
						"Text": "Auto-blokada przy zmianie siatki:"
					},
					"Key": "Config_AutoHold"
				},
				{
					"Source": {
						"Text": "Automatically connect conveyor belts between placed buildings and distributors."
					},
					"Translation": {
						"Text": "Automatycznie łącz taśmociągi między ustawionymi budynkami a rozdzielaczami."
					},
					"Key": "P.bAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Automatically connect hypertubes between placed supports."
					},
					"Translation": {
						"Text": "Automatycznie łącz hyperrury między ustawionymi podporami."
					},
					"Key": "P.bHypertubeAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Automatically connect pipes between placed buildings."
					},
					"Translation": {
						"Text": "Automatycznie łącz rury między ustawionymi budynkami."
					},
					"Key": "P.bPipeAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Automatically lock the hologram in place after any grid change. Press the Hold key to release it."
					},
					"Translation": {
						"Text": "Automatycznie blokuj hologram w miejscu po każdej zmianie siatki. Naciśnij klawisz blokady, aby zwolnić."
					},
					"Key": "P.bAutoHoldOnGridChange.TT"
				},
				{
					"Source": {
						"Text": "Automatically run conveyor belts between the buildings you place."
					},
					"Translation": {
						"Text": "Automatycznie prowadź taśmociągi między budynkami, które ustawiasz."
					},
					"Key": "Sec.Belt.TT"
				},
				{
					"Source": {
						"Text": "Automatically run hypertubes between the supports you place."
					},
					"Translation": {
						"Text": "Automatycznie prowadź hyperrury między ustawionymi podporami."
					},
					"Key": "Sec.Hypertube.TT"
				},
				{
					"Source": {
						"Text": "Automatically run pipes between the buildings you place."
					},
					"Translation": {
						"Text": "Automatycznie prowadź rury między budynkami, które ustawiasz."
					},
					"Key": "Sec.Pipe.TT"
				},
				{
					"Source": {
						"Text": "Automatically wire power between buildings and power poles as you build."
					},
					"Translation": {
						"Text": "Automatycznie okablowuj zasilanie między budynkami a słupami energetycznymi podczas budowania."
					},
					"Key": "Sec.Power.TT"
				},
				{
					"Source": {
						"Text": "Automatically wire power between placed buildings and nearby power poles."
					},
					"Translation": {
						"Text": "Automatycznie okablowuj zasilanie między ustawionymi budynkami a pobliskimi słupami energetycznymi."
					},
					"Key": "P.bPowerAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Backward"
					},
					"Translation": {
						"Text": "Wstecz"
					},
					"Key": "Walk_Opt_Backward"
				},
				{
					"Source": {
						"Text": "Belt"
					},
					"Translation": {
						"Text": "Taśma"
					},
					"Key": "Walk_Conveyance_Belt"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie taśm"
					},
					"Key": "Sec.Belt"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie taśm"
					},
					"Key": "P.bAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect:"
					},
					"Translation": {
						"Text": "Automatyczne łączenie taśm:"
					},
					"Key": "Config_AutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect:"
					},
					"Translation": {
						"Text": "Automatyczne łączenie taśm:"
					},
					"Key": "Panel_AC_BeltEnabled"
				},
				{
					"Source": {
						"Text": "Belt Routing Mode"
					},
					"Translation": {
						"Text": "Tryb trasowania taśm"
					},
					"Key": "P.BeltRoutingMode"
				},
				{
					"Source": {
						"Text": "Belt Routing Mode:"
					},
					"Translation": {
						"Text": "Tryb trasowania taśm:"
					},
					"Key": "Config_BeltRoutingMode"
				},
				{
					"Source": {
						"Text": "Belt tier for distributor-to-building connections. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Poziom taśmy dla połączeń rozdzielacz-budynek. Auto używa najwyższego odblokowanego poziomu."
					},
					"Key": "P.BeltLevelToBuilding.TT"
				},
				{
					"Source": {
						"Text": "Belt tier for distributor-to-distributor (manifold) connections. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Poziom taśmy dla połączeń rozdzielacz-rozdzielacz (kolektor). Auto używa najwyższego odblokowanego poziomu."
					},
					"Key": "P.BeltLevelMain.TT"
				},
				{
					"Source": {
						"Text": "Building Behavior"
					},
					"Translation": {
						"Text": "Zachowanie budowania"
					},
					"Key": "Sec.Building"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "Anuluj"
					},
					"Key": "Upgrade_Btn_Cancel"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "Anuluj"
					},
					"Key": "Panel_Btn_Cancel"
				},
				{
					"Source": {
						"Text": "Cannot find player location"
					},
					"Translation": {
						"Text": "Nie można znaleźć lokalizacji gracza"
					},
					"Key": "Upgrade_NoPlayerLoc"
				},
				{
					"Source": {
						"Text": "Capture:"
					},
					"Translation": {
						"Text": "Przechwyć:"
					},
					"Key": "Panel_Restore_Capture"
				},
				{
					"Source": {
						"Text": "Chain distributors together with manifold lane belts, so a whole row is fed from one input."
					},
					"Translation": {
						"Text": "Łącz rozdzielacze w łańcuch za pomocą taśm rozdzielacza, aby cały rząd był zasilany z jednego wejścia."
					},
					"Key": "P.bAutoConnectDistributors.TT"
				},
				{
					"Source": {
						"Text": "Chain:"
					},
					"Translation": {
						"Text": "Łańcuch:"
					},
					"Key": "Panel_AC_Chain"
				},
				{
					"Source": {
						"Text": "Clean"
					},
					"Translation": {
						"Text": "Czysty"
					},
					"Key": "Walk_Opt_Clean"
				},
				{
					"Source": {
						"Text": "Clear"
					},
					"Translation": {
						"Text": "Wyczyść"
					},
					"Key": "Panel_Btn_ClearRecipe"
				},
				{
					"Source": {
						"Text": "Click to select {0} for upgrade"
					},
					"Translation": {
						"Text": "Kliknij, aby wybrać {0} do ulepszenia"
					},
					"Key": "Upgrade_ClickToSelect"
				},
				{
					"Source": {
						"Text": "Close"
					},
					"Translation": {
						"Text": "Zamknij"
					},
					"Key": "Upgrade_Btn_Close"
				},
				{
					"Source": {
						"Text": "Color theme for the HUD: Default (FICSIT orange), Dark, Classic, High Contrast, Minimal, or Monochrome."
					},
					"Translation": {
						"Text": "Motyw kolorystyczny HUD: Domyślny (pomarańcz FICSIT), Ciemny, Klasyczny, Wysoki kontrast, Minimalny lub Monochromatyczny."
					},
					"Key": "P.HUDTheme.TT"
				},
				{
					"Source": {
						"Text": "Connection Range"
					},
					"Translation": {
						"Text": "Zasięg połączenia"
					},
					"Key": "P.PowerConnectRange"
				},
				{
					"Source": {
						"Text": "Connection Range:"
					},
					"Translation": {
						"Text": "Zasięg połączenia:"
					},
					"Key": "Config_PowerRange"
				},
				{
					"Source": {
						"Text": "Connections to Keep Free"
					},
					"Translation": {
						"Text": "Połączenia do pozostawienia wolnych"
					},
					"Key": "P.PowerConnectReserved"
				},
				{
					"Source": {
						"Text": "Continue"
					},
					"Translation": {
						"Text": "Kontynuuj"
					},
					"Key": "Panel_Btn_Continue"
				},
				{
					"Source": {
						"Text": "Conveyor Belts"
					},
					"Translation": {
						"Text": "Taśmociągi"
					},
					"Key": "Family_Belt"
				},
				{
					"Source": {
						"Text": "Conveyor Lifts"
					},
					"Translation": {
						"Text": "Podnośniki taśmowe"
					},
					"Key": "Family_Lift"
				},
				{
					"Source": {
						"Text": "Created:"
					},
					"Translation": {
						"Text": "Utworzono:"
					},
					"Key": "Panel_Restore_CreatedAt"
				},
				{
					"Source": {
						"Text": "Cross Splitters/Mergers"
					},
					"Translation": {
						"Text": "Przez rozdzielacze/łączniki"
					},
					"Key": "Upgrade_CrossSplitters"
				},
				{
					"Source": {
						"Text": "Cross Storage Containers"
					},
					"Translation": {
						"Text": "Przez kontenery magazynowe"
					},
					"Key": "Upgrade_CrossStorage"
				},
				{
					"Source": {
						"Text": "Cross Train Platforms"
					},
					"Translation": {
						"Text": "Przez perony kolejowe"
					},
					"Key": "Upgrade_CrossTrains"
				},
				{
					"Source": {
						"Text": "Curve"
					},
					"Translation": {
						"Text": "Łuk"
					},
					"Key": "Walk_Opt_Curve"
				},
				{
					"Source": {
						"Text": "Cycle Mode"
					},
					"Translation": {
						"Text": "Przełącz tryb"
					},
					"Key": "Hint_CycleMode"
				},
				{
					"Source": {
						"Text": "Daisy-Chain Pole-less Factories"
					},
					"Translation": {
						"Text": "Łańcuchowanie fabryk bez słupów"
					},
					"Key": "P.bExtendDaisyChainPoleless"
				},
				{
					"Source": {
						"Text": "Default"
					},
					"Translation": {
						"Text": "Domyślny"
					},
					"Key": "Walk_Opt_Default"
				},
				{
					"Source": {
						"Text": "Delete"
					},
					"Translation": {
						"Text": "Usuń"
					},
					"Key": "Panel_Btn_DeletePreset"
				},
				{
					"Source": {
						"Text": "Delete Preset"
					},
					"Translation": {
						"Text": "Usuń zestaw"
					},
					"Key": "Panel_Restore_DeleteTitle"
				},
				{
					"Source": {
						"Text": "Delete preset '{0}'?"
					},
					"Translation": {
						"Text": "Usunąć zestaw '{0}'?"
					},
					"Key": "Panel_Restore_DeleteMessage"
				},
				{
					"Source": {
						"Text": "Description:"
					},
					"Translation": {
						"Text": "Opis:"
					},
					"Key": "Panel_Restore_Description"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "Kierunek"
					},
					"Key": "Walk_Lbl_Direction"
				},
				{
					"Source": {
						"Text": "Direction:"
					},
					"Translation": {
						"Text": "Kierunek:"
					},
					"Key": "Panel_AC_Direction"
				},
				{
					"Source": {
						"Text": "Directional arrows drawn on the building hologram."
					},
					"Translation": {
						"Text": "Strzałki kierunku rysowane na hologramie budynku."
					},
					"Key": "Sec.Arrows.TT"
				},
				{
					"Source": {
						"Text": "Double Wall Outlet Mk.{0}"
					},
					"Translation": {
						"Text": "Dwustronny ścienny rozdzielacz Mk.{0}"
					},
					"Key": "UpgradeRow_DoubleWallOutlet"
				},
				{
					"Source": {
						"Text": "EXTREME GRID WARNING!"
					},
					"Translation": {
						"Text": "EKSTREMALNY ROZMIAR SIATKI!"
					},
					"Key": "Panel_Confirm_ExtremeTitle"
				},
				{
					"Source": {
						"Text": "Enable Extend - repeat a building or grid outward in one direction."
					},
					"Translation": {
						"Text": "Włącz Rozszerzanie - powtarzaj budynek lub siatkę na zewnątrz w jednym kierunku."
					},
					"Key": "P.bExtendEnabled.TT"
				},
				{
					"Source": {
						"Text": "Entire Map"
					},
					"Translation": {
						"Text": "Cała mapa"
					},
					"Key": "Upgrade_Btn_EntireMap"
				},
				{
					"Source": {
						"Text": "Error: Execution service not available"
					},
					"Translation": {
						"Text": "Błąd: usługa wykonawcza niedostępna"
					},
					"Key": "Upgrade_ErrExecution"
				},
				{
					"Source": {
						"Text": "Error: No player controller"
					},
					"Translation": {
						"Text": "Błąd: Brak kontrolera gracza"
					},
					"Key": "Upgrade_ErrNoPlayer"
				},
				{
					"Source": {
						"Text": "Error: Subsystem not available"
					},
					"Translation": {
						"Text": "Błąd: podsystem niedostępny"
					},
					"Key": "Upgrade_ErrSubsystem"
				},
				{
					"Source": {
						"Text": "Error: server connection unavailable"
					},
					"Translation": {
						"Text": "Błąd: połączenie z serwerem niedostępne"
					},
					"Key": "Upgrade_ErrRCOScan"
				},
				{
					"Source": {
						"Text": "Error: server connection unavailable"
					},
					"Translation": {
						"Text": "Błąd: połączenie z serwerem niedostępne"
					},
					"Key": "Upgrade_ErrRCO"
				},
				{
					"Source": {
						"Text": "Estimated Cost"
					},
					"Translation": {
						"Text": "Szacowany koszt"
					},
					"Key": "Upgrade_EstimatedCost"
				},
				{
					"Source": {
						"Text": "Exit"
					},
					"Translation": {
						"Text": "Kurs wyj."
					},
					"Key": "Walk_Col_Exit"
				},
				{
					"Source": {
						"Text": "Export to Clipboard"
					},
					"Translation": {
						"Text": "Eksportuj do schowka"
					},
					"Key": "Panel_Btn_ExportPreset"
				},
				{
					"Source": {
						"Text": "Extend Daisy-Chain Power"
					},
					"Translation": {
						"Text": "Rozszerzanie zasilania łańcuchowego"
					},
					"Key": "P.bExtendDaisyChainPower"
				},
				{
					"Source": {
						"Text": "Extend Enabled"
					},
					"Translation": {
						"Text": "Rozszerzanie włączone"
					},
					"Key": "P.bExtendEnabled"
				},
				{
					"Source": {
						"Text": "Extend Enabled:"
					},
					"Translation": {
						"Text": "Rozszerzanie włączone:"
					},
					"Key": "Config_ExtendEnabled"
				},
				{
					"Source": {
						"Text": "Extend Power Poles"
					},
					"Translation": {
						"Text": "Rozszerzanie słupów"
					},
					"Key": "P.bExtendPowerEnabled"
				},
				{
					"Source": {
						"Text": "Extend Power Poles:"
					},
					"Translation": {
						"Text": "Rozszerzanie słupów:"
					},
					"Key": "Config_ExtendPower"
				},
				{
					"Source": {
						"Text": "Factory Belt"
					},
					"Translation": {
						"Text": "Taśma fabryczna"
					},
					"Key": "P.BeltLevelToBuilding"
				},
				{
					"Source": {
						"Text": "Factory Belt:"
					},
					"Translation": {
						"Text": "Taśma fabryczna:"
					},
					"Key": "Config_FactoryBelt"
				},
				{
					"Source": {
						"Text": "Flow Indicator"
					},
					"Translation": {
						"Text": "Wskaźnik przepływu"
					},
					"Key": "P.PipeIndicator"
				},
				{
					"Source": {
						"Text": "Flow Indicator:"
					},
					"Translation": {
						"Text": "Wskaźnik przepływu:"
					},
					"Key": "Config_FlowIndicator"
				},
				{
					"Source": {
						"Text": "Flow Indicator:"
					},
					"Translation": {
						"Text": "Wskaźnik przepływu:"
					},
					"Key": "Panel_AC_FlowIndicator"
				},
				{
					"Source": {
						"Text": "Forward"
					},
					"Translation": {
						"Text": "Naprzód"
					},
					"Key": "Walk_Opt_Forward"
				},
				{
					"Source": {
						"Text": "Found {0} items ({1} upgradeable)"
					},
					"Translation": {
						"Text": "Znaleziono {0} elementów ({1} ulepszalnych)"
					},
					"Key": "Upgrade_FoundItems"
				},
				{
					"Source": {
						"Text": "Grid"
					},
					"Translation": {
						"Text": "Siatka"
					},
					"Key": "Panel_Section_Grid"
				},
				{
					"Source": {
						"Text": "Grid"
					},
					"Translation": {
						"Text": "Siatka"
					},
					"Key": "Panel_Restore_CaptureGrid"
				},
				{
					"Source": {
						"Text": "Grid Axis"
					},
					"Translation": {
						"Text": "Oś siatki"
					},
					"Key": "P.PowerConnectMode"
				},
				{
					"Source": {
						"Text": "Grid Axis:"
					},
					"Translation": {
						"Text": "Oś siatki:"
					},
					"Key": "Panel_AC_GridAxis"
				},
				{
					"Source": {
						"Text": "Grid Axis:"
					},
					"Translation": {
						"Text": "Oś siatki:"
					},
					"Key": "Config_PowerGridAxis"
				},
				{
					"Source": {
						"Text": "Grid Total: {0} holograms"
					},
					"Translation": {
						"Text": "Suma siatki: {0} hologramów"
					},
					"Key": "Panel_GridTotal"
				},
				{
					"Source": {
						"Text": "Grid [X]:"
					},
					"Translation": {
						"Text": "Siatka [X]:"
					},
					"Key": "Panel_GridX"
				},
				{
					"Source": {
						"Text": "Grid [Y]:"
					},
					"Translation": {
						"Text": "Siatka [Y]:"
					},
					"Key": "Panel_GridY"
				},
				{
					"Source": {
						"Text": "Grid [Z]:"
					},
					"Translation": {
						"Text": "Siatka [Z]:"
					},
					"Key": "Panel_GridZ"
				},
				{
					"Source": {
						"Text": "Grid: 1x1x1"
					},
					"Translation": {
						"Text": "Siatka: 1x1x1"
					},
					"Key": "HUD_GridDefault"
				},
				{
					"Source": {
						"Text": "Grid: {0}x{1}x{2} ({3})"
					},
					"Translation": {
						"Text": "Siatka: {0}x{1}x{2} ({3})"
					},
					"Key": "HUD_Grid"
				},
				{
					"Source": {
						"Text": "H->V"
					},
					"Translation": {
						"Text": "Poz→Pion"
					},
					"Key": "Walk_Opt_HToV"
				},
				{
					"Source": {
						"Text": "HUD"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Sec.HUD"
				},
				{
					"Source": {
						"Text": "HUD Position X"
					},
					"Translation": {
						"Text": "Pozycja HUD X"
					},
					"Key": "Config_HUDPosX"
				},
				{
					"Source": {
						"Text": "HUD Position X"
					},
					"Translation": {
						"Text": "Pozycja HUD X"
					},
					"Key": "P.HUDPositionX"
				},
				{
					"Source": {
						"Text": "HUD Position Y"
					},
					"Translation": {
						"Text": "Pozycja HUD Y"
					},
					"Key": "P.HUDPositionY"
				},
				{
					"Source": {
						"Text": "HUD Position Y"
					},
					"Translation": {
						"Text": "Pozycja HUD Y"
					},
					"Key": "Config_HUDPosY"
				},
				{
					"Source": {
						"Text": "HUD Scale"
					},
					"Translation": {
						"Text": "Skala HUD"
					},
					"Key": "P.HUDScale"
				},
				{
					"Source": {
						"Text": "HUD Theme"
					},
					"Translation": {
						"Text": "Motyw HUD"
					},
					"Key": "P.HUDTheme"
				},
				{
					"Source": {
						"Text": "HUD Theme:"
					},
					"Translation": {
						"Text": "Motyw HUD:"
					},
					"Key": "Config_HUDTheme"
				},
				{
					"Source": {
						"Text": "Horizontal position of the HUD on screen (0 = left edge, 1 = right edge)."
					},
					"Translation": {
						"Text": "Pozioma pozycja HUD na ekranie (0 = lewa krawędź, 1 = prawa krawędź)."
					},
					"Key": "P.HUDPositionX.TT"
				},
				{
					"Source": {
						"Text": "How Extend, auto-hold, and Apply behave while building."
					},
					"Translation": {
						"Text": "Jak zachowują się Rozszerzanie, auto-blokada i Zastosuj podczas budowania."
					},
					"Key": "Sec.Building.TT"
				},
				{
					"Source": {
						"Text": "How auto-connected belts are shaped: Default, Curve, or Straight."
					},
					"Translation": {
						"Text": "Jak kształtowane są automatycznie łączone taśmy: Domyślny, Łuk lub Prosta."
					},
					"Key": "P.BeltRoutingMode.TT"
				},
				{
					"Source": {
						"Text": "How auto-connected hypertubes are shaped: Auto, 2D, Straight, Curve, Noodle, or Horizontal-to-Vertical."
					},
					"Translation": {
						"Text": "Jak kształtowane są automatycznie łączone hyperrury: Auto, 2D, Prosta, Łuk, Makaron lub Poziomo-do-pionu."
					},
					"Key": "P.HypertubeRoutingMode.TT"
				},
				{
					"Source": {
						"Text": "How auto-connected pipes are shaped: Auto, 2D, Straight, Curve, Noodle, or Horizontal-to-Vertical."
					},
					"Translation": {
						"Text": "Jak kształtowane są automatycznie łączone rury: Auto, 2D, Prosta, Łuk, Makaron lub Poziom-do-pionu."
					},
					"Key": "P.PipeRoutingMode.TT"
				},
				{
					"Source": {
						"Text": "Hypertube"
					},
					"Translation": {
						"Text": "Hypertube"
					},
					"Key": "Walk_Conveyance_Hypertube"
				},
				{
					"Source": {
						"Text": "Hypertube Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie Hypertube"
					},
					"Key": "Sec.Hypertube"
				},
				{
					"Source": {
						"Text": "Hypertube Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie Hypertube"
					},
					"Key": "P.bHypertubeAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Hypertube Routing Mode"
					},
					"Translation": {
						"Text": "Tryb trasowania Hypertube"
					},
					"Key": "P.HypertubeRoutingMode"
				},
				{
					"Source": {
						"Text": "Import from Clipboard"
					},
					"Translation": {
						"Text": "Importuj ze schowka"
					},
					"Key": "Panel_Btn_ImportPreset"
				},
				{
					"Source": {
						"Text": "Import from Last Extend"
					},
					"Translation": {
						"Text": "Importuj z ostatniego Rozszerzenia"
					},
					"Key": "Panel_Btn_ImportFromExtend"
				},
				{
					"Source": {
						"Text": "Include power poles when using Extend."
					},
					"Translation": {
						"Text": "Uwzględnij słupy energetyczne podczas używania Rozszerzania."
					},
					"Key": "P.bExtendPowerEnabled.TT"
				},
				{
					"Source": {
						"Text": "Invalid: {0}"
					},
					"Translation": {
						"Text": "Nieprawidłowy: {0}"
					},
					"Key": "Upgrade_Invalid"
				},
				{
					"Source": {
						"Text": "Large Grid Warning"
					},
					"Translation": {
						"Text": "Ostrzeżenie: Duża siatka"
					},
					"Key": "Panel_Confirm_LargeTitle"
				},
				{
					"Source": {
						"Text": "Lift: ↕ {0}m  ⇓ {1}m"
					},
					"Translation": {
						"Text": "Winda: ↕ {0}m  ⇓ {1}m"
					},
					"Key": "HUD_LiftHeight"
				},
				{
					"Source": {
						"Text": "Main Tier"
					},
					"Translation": {
						"Text": "Główny poziom"
					},
					"Key": "P.PipeLevelMain"
				},
				{
					"Source": {
						"Text": "Main Tier:"
					},
					"Translation": {
						"Text": "Główny poziom:"
					},
					"Key": "Panel_AC_MainTier"
				},
				{
					"Source": {
						"Text": "Main Tier:"
					},
					"Translation": {
						"Text": "Główny poziom:"
					},
					"Key": "Config_PipeMainTier"
				},
				{
					"Source": {
						"Text": "Manifold Lane Belt"
					},
					"Translation": {
						"Text": "Taśma rozdzielacza"
					},
					"Key": "P.BeltLevelMain"
				},
				{
					"Source": {
						"Text": "Manifold Lane Belt:"
					},
					"Translation": {
						"Text": "Taśma rozdzielacza:"
					},
					"Key": "Config_ManifoldLaneBelt"
				},
				{
					"Source": {
						"Text": "Maximum distance, in meters, to search for a power connection."
					},
					"Translation": {
						"Text": "Maksymalna odległość, w metrach, do wyszukiwania połączenia zasilania."
					},
					"Key": "P.PowerConnectRange.TT"
				},
				{
					"Source": {
						"Text": "Nearest {0}: {1}m {2}"
					},
					"Translation": {
						"Text": "Najbliższy {0}: {1}m {2}"
					},
					"Key": "Upgrade_Nearest"
				},
				{
					"Source": {
						"Text": "Network"
					},
					"Translation": {
						"Text": "Sieć"
					},
					"Key": "Upgrade_Tab_Network"
				},
				{
					"Source": {
						"Text": "New Preset Name:"
					},
					"Translation": {
						"Text": "Nazwa nowego zestawu:"
					},
					"Key": "Panel_Restore_PresetName"
				},
				{
					"Source": {
						"Text": "No audit snapshot. Press Scan to start."
					},
					"Translation": {
						"Text": "Brak danych audytu. Naciśnij Skanuj, aby rozpocząć."
					},
					"Key": "Upgrade_NoAudit"
				},
				{
					"Source": {
						"Text": "No compatible recipes"
					},
					"Translation": {
						"Text": "Brak kompatybilnych receptur"
					},
					"Key": "Panel_Recipe_NoCompatible"
				},
				{
					"Source": {
						"Text": "No family selected - scan first"
					},
					"Translation": {
						"Text": "Nie wybrano rodziny — najpierw zeskanuj"
					},
					"Key": "Upgrade_NoFamily"
				},
				{
					"Source": {
						"Text": "No instances found (entries not stored)"
					},
					"Translation": {
						"Text": "Nie znaleziono instancji (wpisy nie zostały zapisane)"
					},
					"Key": "Upgrade_NoInstances"
				},
				{
					"Source": {
						"Text": "No items to upgrade"
					},
					"Translation": {
						"Text": "Brak elementów do ulepszenia"
					},
					"Key": "Upgrade_NoItems"
				},
				{
					"Source": {
						"Text": "No recipe selected ({0} available)"
					},
					"Translation": {
						"Text": "Nie wybrano receptury ({0} dostępnych)"
					},
					"Key": "Panel_Recipe_NoneSelected_Count"
				},
				{
					"Source": {
						"Text": "No target - aim at a buildable"
					},
					"Translation": {
						"Text": "Brak celu — wyceluj w budynek"
					},
					"Key": "Upgrade_NoTarget"
				},
				{
					"Source": {
						"Text": "None Selected"
					},
					"Translation": {
						"Text": "Nie wybrano"
					},
					"Key": "Panel_Recipe_NoneSelected"
				},
				{
					"Source": {
						"Text": "Noodle"
					},
					"Translation": {
						"Text": "Makaron"
					},
					"Key": "Walk_Opt_Noodle"
				},
				{
					"Source": {
						"Text": "Normal"
					},
					"Translation": {
						"Text": "Normalny"
					},
					"Key": "Walk_Opt_Normal"
				},
				{
					"Source": {
						"Text": "Not saved"
					},
					"Translation": {
						"Text": "Nie zapisano"
					},
					"Key": "Panel_Restore_NotSaved"
				},
				{
					"Source": {
						"Text": "Number of pole connection slots to leave free for your own manual wiring."
					},
					"Translation": {
						"Text": "Liczba gniazd połączeń słupa pozostawianych wolnych dla własnego ręcznego okablowania."
					},
					"Key": "P.PowerConnectReserved.TT"
				},
				{
					"Source": {
						"Text": "Once Upgraded Power Connectors is unlocked, Extend wires power directly building-to-building along the lane instead of running a pole to each building."
					},
					"Translation": {
						"Text": "Po odblokowaniu Ulepszonych łączników zasilania Rozszerzanie okablowuje zasilanie bezpośrednio budynek-do-budynku wzdłuż rzędu, zamiast prowadzić słup do każdego budynku."
					},
					"Key": "P.bExtendDaisyChainPower.TT"
				},
				{
					"Source": {
						"Text": "Overwrite Preset"
					},
					"Translation": {
						"Text": "Nadpisz zestaw"
					},
					"Key": "Panel_Restore_OverwriteTitle"
				},
				{
					"Source": {
						"Text": "Pipe"
					},
					"Translation": {
						"Text": "Rura"
					},
					"Key": "Walk_Conveyance_Pipe"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie rur"
					},
					"Key": "Sec.Pipe"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie rur"
					},
					"Key": "P.bPipeAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect:"
					},
					"Translation": {
						"Text": "Automatyczne łączenie rur:"
					},
					"Key": "Config_PipeAutoConnect"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect:"
					},
					"Translation": {
						"Text": "Automatyczne łączenie rur:"
					},
					"Key": "Panel_AC_PipeEnabled"
				},
				{
					"Source": {
						"Text": "Pipe Routing Mode"
					},
					"Translation": {
						"Text": "Tryb trasowania rur"
					},
					"Key": "P.PipeRoutingMode"
				},
				{
					"Source": {
						"Text": "Pipe Routing Mode:"
					},
					"Translation": {
						"Text": "Tryb trasowania rur:"
					},
					"Key": "Config_PipeRoutingMode"
				},
				{
					"Source": {
						"Text": "Pipe Style"
					},
					"Translation": {
						"Text": "Styl rury"
					},
					"Key": "Walk_Lbl_PipeStyle"
				},
				{
					"Source": {
						"Text": "Pipe tier for connections to buildings. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Poziom rury dla połączeń z budynkami. Auto używa najwyższego odblokowanego poziomu."
					},
					"Key": "P.PipeLevelToBuilding.TT"
				},
				{
					"Source": {
						"Text": "Pipe tier for the main connections. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Poziom rury dla połączeń głównych. Auto używa najwyższego odblokowanego poziomu."
					},
					"Key": "P.PipeLevelMain.TT"
				},
				{
					"Source": {
						"Text": "Pipeline Pumps"
					},
					"Translation": {
						"Text": "Pompy rurociągowe"
					},
					"Key": "Family_Pump"
				},
				{
					"Source": {
						"Text": "Pipelines"
					},
					"Translation": {
						"Text": "Rurociągi"
					},
					"Key": "Family_Pipe"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie zasilania"
					},
					"Key": "Sec.Power"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie zasilania"
					},
					"Key": "P.bPowerAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect:"
					},
					"Translation": {
						"Text": "Automatyczne łączenie zasilania:"
					},
					"Key": "Config_PowerAutoConnect"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect:"
					},
					"Translation": {
						"Text": "Automatyczne łączenie zasilania:"
					},
					"Key": "Panel_AC_PowerEnabled"
				},
				{
					"Source": {
						"Text": "Power Poles"
					},
					"Translation": {
						"Text": "Słup energetyczny"
					},
					"Key": "Family_PowerPole"
				},
				{
					"Source": {
						"Text": "Power Towers"
					},
					"Translation": {
						"Text": "Wieża energetyczna"
					},
					"Key": "Family_Tower"
				},
				{
					"Source": {
						"Text": "Press Scan to find upgradeable items"
					},
					"Translation": {
						"Text": "Naciśnij Skanuj, aby znaleźć elementy do ulepszenia"
					},
					"Key": "Upgrade_PressScan"
				},
				{
					"Source": {
						"Text": "Radius"
					},
					"Translation": {
						"Text": "Promień"
					},
					"Key": "Upgrade_Tab_Radius"
				},
				{
					"Source": {
						"Text": "Radius (m):"
					},
					"Translation": {
						"Text": "Promień (m):"
					},
					"Key": "Upgrade_RadiusLabel"
				},
				{
					"Source": {
						"Text": "Ready"
					},
					"Translation": {
						"Text": "Gotowe"
					},
					"Key": "Upgrade_Ready"
				},
				{
					"Source": {
						"Text": "Recipe"
					},
					"Translation": {
						"Text": "Receptura"
					},
					"Key": "Panel_Restore_CaptureRecipe"
				},
				{
					"Source": {
						"Text": "Recipe"
					},
					"Translation": {
						"Text": "Receptura"
					},
					"Key": "Hint_Recipe"
				},
				{
					"Source": {
						"Text": "Recipe {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Przepis {0}/{1}: {2}"
					},
					"Key": "HUD_Recipe"
				},
				{
					"Source": {
						"Text": "Recipe {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Receptura {0}/{1}: {2}"
					},
					"Key": "Panel_Recipe"
				},
				{
					"Source": {
						"Text": "Recipe* {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Receptura* {0}/{1}: {2}"
					},
					"Key": "Panel_Recipe_Active"
				},
				{
					"Source": {
						"Text": "Recipe* {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Przepis* {0}/{1}: {2}"
					},
					"Key": "HUD_RecipeActive"
				},
				{
					"Source": {
						"Text": "Recipes"
					},
					"Translation": {
						"Text": "Przepisy"
					},
					"Key": "Panel_RecipeHeader"
				},
				{
					"Source": {
						"Text": "Reserved:"
					},
					"Translation": {
						"Text": "Zarezerwowane:"
					},
					"Key": "Panel_AC_Reserved"
				},
				{
					"Source": {
						"Text": "Reset"
					},
					"Translation": {
						"Text": "Resetuj"
					},
					"Key": "Panel_Btn_Reset"
				},
				{
					"Source": {
						"Text": "Rise m"
					},
					"Translation": {
						"Text": "Wznoszenie m"
					},
					"Key": "Walk_Col_Rise"
				},
				{
					"Source": {
						"Text": "Rise{0}: {1}m"
					},
					"Translation": {
						"Text": "Wznoszenie{0}: {1}m"
					},
					"Key": "HUD_WalkRise"
				},
				{
					"Source": {
						"Text": "Rotation"
					},
					"Translation": {
						"Text": "Obrót"
					},
					"Key": "Panel_Restore_CaptureRotation"
				},
				{
					"Source": {
						"Text": "Rotation"
					},
					"Translation": {
						"Text": "Obrót"
					},
					"Key": "Hint_Rotation"
				},
				{
					"Source": {
						"Text": "Rotation"
					},
					"Translation": {
						"Text": "Obrót"
					},
					"Key": "Panel_Section_Rotation"
				},
				{
					"Source": {
						"Text": "Rotation [Z]:"
					},
					"Translation": {
						"Text": "Obrót [Z]:"
					},
					"Key": "Panel_RotationZ"
				},
				{
					"Source": {
						"Text": "Rotation [Z]{0}: {1}°"
					},
					"Translation": {
						"Text": "Obrót [Z]{0}: {1}°"
					},
					"Key": "HUD_RotationZ"
				},
				{
					"Source": {
						"Text": "Rotation [Z]{0}: {1}° (R={2}m, {3}/circle)"
					},
					"Translation": {
						"Text": "Obrót [Z]{0}: {1}° (R={2}m, {3}/okrąg)"
					},
					"Key": "HUD_RotationZFull"
				},
				{
					"Source": {
						"Text": "Rotation*: 0.0°"
					},
					"Translation": {
						"Text": "Obrót*: 0.0°"
					},
					"Key": "HUD_RotationDefault"
				},
				{
					"Source": {
						"Text": "Routing"
					},
					"Translation": {
						"Text": "Trasowanie"
					},
					"Key": "Walk_Lbl_Routing"
				},
				{
					"Source": {
						"Text": "Routing:"
					},
					"Translation": {
						"Text": "Routing:"
					},
					"Key": "Panel_AC_Routing"
				},
				{
					"Source": {
						"Text": "SMART!"
					},
					"Translation": {
						"Text": "SMART!"
					},
					"Key": "HUD_Header"
				},
				{
					"Source": {
						"Text": "Save Current"
					},
					"Translation": {
						"Text": "Zapisz bieżący"
					},
					"Key": "Panel_Btn_SavePreset"
				},
				{
					"Source": {
						"Text": "Scale X"
					},
					"Translation": {
						"Text": "Skaluj X"
					},
					"Key": "Hint_ScaleX"
				},
				{
					"Source": {
						"Text": "Scale Y"
					},
					"Translation": {
						"Text": "Skaluj Y"
					},
					"Key": "Hint_ScaleY"
				},
				{
					"Source": {
						"Text": "Scale Z"
					},
					"Translation": {
						"Text": "Skaluj Z"
					},
					"Key": "Hint_ScaleZ"
				},
				{
					"Source": {
						"Text": "Scan"
					},
					"Translation": {
						"Text": "Skanuj"
					},
					"Key": "Upgrade_Btn_Scan"
				},
				{
					"Source": {
						"Text": "Scan Network"
					},
					"Translation": {
						"Text": "Skanuj sieć"
					},
					"Key": "Upgrade_Btn_ScanNetwork"
				},
				{
					"Source": {
						"Text": "Scan failed: {0}"
					},
					"Translation": {
						"Text": "Skanowanie nieudane: {0}"
					},
					"Key": "Upgrade_ScanFailed"
				},
				{
					"Source": {
						"Text": "Scan network to see costs"
					},
					"Translation": {
						"Text": "Zeskanuj sieć, aby zobaczyć koszty"
					},
					"Key": "Upgrade_ScanCosts"
				},
				{
					"Source": {
						"Text": "Scanning network..."
					},
					"Translation": {
						"Text": "Skanowanie sieci..."
					},
					"Key": "Upgrade_Scanning"
				},
				{
					"Source": {
						"Text": "Select a family to see costs"
					},
					"Translation": {
						"Text": "Wybierz rodzinę, aby zobaczyć koszty"
					},
					"Key": "Upgrade_SelectFamily"
				},
				{
					"Source": {
						"Text": "Select a row first to upgrade"
					},
					"Translation": {
						"Text": "Najpierw wybierz wiersz do ulepszenia"
					},
					"Key": "Upgrade_SelectRow"
				},
				{
					"Source": {
						"Text": "Select a target tier from the dropdown"
					},
					"Translation": {
						"Text": "Wybierz docelowy poziom z listy rozwijanej"
					},
					"Key": "Upgrade_SelectTier"
				},
				{
					"Source": {
						"Text": "Select target tier"
					},
					"Translation": {
						"Text": "Wybierz docelowy poziom"
					},
					"Key": "Upgrade_SelectTargetTier"
				},
				{
					"Source": {
						"Text": "Selected Preset:"
					},
					"Translation": {
						"Text": "Wybrany zestaw:"
					},
					"Key": "Panel_Restore_SelectPreset"
				},
				{
					"Source": {
						"Text": "Set radius and press Scan to find items"
					},
					"Translation": {
						"Text": "Ustaw promień i naciśnij Skanuj"
					},
					"Key": "Upgrade_SetRadiusScan"
				},
				{
					"Source": {
						"Text": "Settings: {0}"
					},
					"Translation": {
						"Text": "Ustawienia: {0}"
					},
					"Key": "HUD_Settings"
				},
				{
					"Source": {
						"Text": "Settings: {0}*"
					},
					"Translation": {
						"Text": "Ustawienia: {0}*"
					},
					"Key": "HUD_SettingsCurrent"
				},
				{
					"Source": {
						"Text": "Settings: {0}{1}"
					},
					"Translation": {
						"Text": "Ustawienia: {0}{1}"
					},
					"Key": "HUD_SettingsActive"
				},
				{
					"Source": {
						"Text": "Shift m"
					},
					"Translation": {
						"Text": "Przesunięcie m"
					},
					"Key": "Walk_Col_Shift"
				},
				{
					"Source": {
						"Text": "Shift{0}: {1}m"
					},
					"Translation": {
						"Text": "Przesunięcie{0}: {1}m"
					},
					"Key": "HUD_WalkShift"
				},
				{
					"Source": {
						"Text": "Show Direction Arrows"
					},
					"Translation": {
						"Text": "Pokaż strzałki kierunku"
					},
					"Key": "P.bShowArrows"
				},
				{
					"Source": {
						"Text": "Show HUD Overlay"
					},
					"Translation": {
						"Text": "Pokaż HUD"
					},
					"Key": "P.bShowHUD"
				},
				{
					"Source": {
						"Text": "Show HUD Overlay"
					},
					"Translation": {
						"Text": "Pokaż HUD"
					},
					"Key": "Config_ShowHUD"
				},
				{
					"Source": {
						"Text": "Show X/Y/Z axis labels on the direction arrows."
					},
					"Translation": {
						"Text": "Pokaż etykiety osi X/Y/Z na strzałkach kierunku."
					},
					"Key": "P.bShowArrowLabels.TT"
				},
				{
					"Source": {
						"Text": "Show X/Y/Z direction arrows on the building hologram."
					},
					"Translation": {
						"Text": "Pokaż strzałki kierunku X/Y/Z na hologramie budynku."
					},
					"Key": "P.bShowArrows.TT"
				},
				{
					"Source": {
						"Text": "Show a flow-direction indicator on auto-connected pipes."
					},
					"Translation": {
						"Text": "Pokaż wskaźnik kierunku przepływu na automatycznie łączonych rurach."
					},
					"Key": "P.PipeIndicator.TT"
				},
				{
					"Source": {
						"Text": "Show the Smart! overlay (grid, scale, and recipe info) while building."
					},
					"Translation": {
						"Text": "Pokaż nakładkę Smart! (informacje o siatce, skali i recepturze) podczas budowania."
					},
					"Key": "P.bShowHUD.TT"
				},
				{
					"Source": {
						"Text": "Size of the Smart! HUD overlay."
					},
					"Translation": {
						"Text": "Rozmiar nakładki HUD Smart!."
					},
					"Key": "P.HUDScale.TT"
				},
				{
					"Source": {
						"Text": "Smart Panel"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Hint_SmartPanel"
				},
				{
					"Source": {
						"Text": "Smart Restore"
					},
					"Translation": {
						"Text": "Smart! Przywracanie"
					},
					"Key": "Panel_Section_Presets"
				},
				{
					"Source": {
						"Text": "Smart Walking"
					},
					"Translation": {
						"Text": "Smart! Chodzenie"
					},
					"Key": "Panel_Btn_SmartWalking"
				},
				{
					"Source": {
						"Text": "Smart!"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Config.Root.Name"
				},
				{
					"Source": {
						"Text": "Smart!"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Config.DisplayName"
				},
				{
					"Source": {
						"Text": "Smart! Extend"
					},
					"Translation": {
						"Text": "Smart! Rozszerzenie"
					},
					"Key": "Panel_Title_Extend"
				},
				{
					"Source": {
						"Text": "Smart! Foundations settings."
					},
					"Translation": {
						"Text": "Ustawienia Smart! Foundations."
					},
					"Key": "Config.Description"
				},
				{
					"Source": {
						"Text": "Smart! Foundations settings."
					},
					"Translation": {
						"Text": "Ustawienia Smart! Foundations."
					},
					"Key": "Config.Root.Tooltip"
				},
				{
					"Source": {
						"Text": "Smart! Panel"
					},
					"Translation": {
						"Text": "Smart! Panel"
					},
					"Key": "Panel_Title"
				},
				{
					"Source": {
						"Text": "Smart! Upgrade Panel"
					},
					"Translation": {
						"Text": "Smart! Panel ulepszeń"
					},
					"Key": "Upgrade_Title"
				},
				{
					"Source": {
						"Text": "Spacing"
					},
					"Translation": {
						"Text": "Odstęp"
					},
					"Key": "Panel_Restore_CaptureSpacing"
				},
				{
					"Source": {
						"Text": "Spacing"
					},
					"Translation": {
						"Text": "Odstęp"
					},
					"Key": "Panel_Section_Spacing"
				},
				{
					"Source": {
						"Text": "Spacing"
					},
					"Translation": {
						"Text": "Odstęp"
					},
					"Key": "Hint_Spacing"
				},
				{
					"Source": {
						"Text": "Spacing [X]:"
					},
					"Translation": {
						"Text": "Odstęp [X]:"
					},
					"Key": "Panel_SpacingX"
				},
				{
					"Source": {
						"Text": "Spacing [X]{0}: {1}m"
					},
					"Translation": {
						"Text": "Odstęp [X]{0}: {1}m"
					},
					"Key": "HUD_SpacingX"
				},
				{
					"Source": {
						"Text": "Spacing [Y]:"
					},
					"Translation": {
						"Text": "Odstęp [Y]:"
					},
					"Key": "Panel_SpacingY"
				},
				{
					"Source": {
						"Text": "Spacing [Y]{0}: {1}m"
					},
					"Translation": {
						"Text": "Odstęp [Y]{0}: {1}m"
					},
					"Key": "HUD_SpacingY"
				},
				{
					"Source": {
						"Text": "Spacing [Z]:"
					},
					"Translation": {
						"Text": "Odstęp [Z]:"
					},
					"Key": "Panel_SpacingZ"
				},
				{
					"Source": {
						"Text": "Spacing [Z]{0}: {1}m"
					},
					"Translation": {
						"Text": "Odstęp [Z]{0}: {1}m"
					},
					"Key": "HUD_SpacingZ"
				},
				{
					"Source": {
						"Text": "Spacing*: 0.0m"
					},
					"Translation": {
						"Text": "Odstęp*: 0.0m"
					},
					"Key": "HUD_SpacingDefault"
				},
				{
					"Source": {
						"Text": "Stackable Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie taśm piętrowalnych"
					},
					"Key": "P.bStackableBeltEnabled"
				},
				{
					"Source": {
						"Text": "Stackable Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Automatyczne łączenie taśm piętrowalnych"
					},
					"Key": "Config_StackableBelt"
				},
				{
					"Source": {
						"Text": "Stagger"
					},
					"Translation": {
						"Text": "Przesunięcie"
					},
					"Key": "Panel_Restore_CaptureStagger"
				},
				{
					"Source": {
						"Text": "Stagger"
					},
					"Translation": {
						"Text": "Przesunięcie"
					},
					"Key": "Hint_Stagger"
				},
				{
					"Source": {
						"Text": "Stagger"
					},
					"Translation": {
						"Text": "Przesunięcie"
					},
					"Key": "Panel_Section_Stagger"
				},
				{
					"Source": {
						"Text": "Stagger [X]:"
					},
					"Translation": {
						"Text": "Przesunięcie [X]:"
					},
					"Key": "Panel_StaggerX"
				},
				{
					"Source": {
						"Text": "Stagger [X]{0}: {1}m sideways"
					},
					"Translation": {
						"Text": "Przesunięcie [X]{0}: {1}m na bok"
					},
					"Key": "HUD_StaggerX"
				},
				{
					"Source": {
						"Text": "Stagger [Y]:"
					},
					"Translation": {
						"Text": "Przesunięcie [Y]:"
					},
					"Key": "Panel_StaggerY"
				},
				{
					"Source": {
						"Text": "Stagger [Y]{0}: {1}m forward"
					},
					"Translation": {
						"Text": "Przesunięcie [Y]{0}: {1}m do przodu"
					},
					"Key": "HUD_StaggerY"
				},
				{
					"Source": {
						"Text": "Stagger [ZX]:"
					},
					"Translation": {
						"Text": "Przesunięcie [ZX]:"
					},
					"Key": "Panel_StaggerZX"
				},
				{
					"Source": {
						"Text": "Stagger [ZX]{0}: {1}m lean forward"
					},
					"Translation": {
						"Text": "Przesunięcie [ZX]{0}: {1}m przesunięcie do przodu"
					},
					"Key": "HUD_StaggerZX"
				},
				{
					"Source": {
						"Text": "Stagger [ZY]:"
					},
					"Translation": {
						"Text": "Przesunięcie [ZY]:"
					},
					"Key": "Panel_StaggerZY"
				},
				{
					"Source": {
						"Text": "Stagger [ZY]{0}: {1}m lean sideways"
					},
					"Translation": {
						"Text": "Przesunięcie [ZY]{0}: {1}m przesunięcie na bok"
					},
					"Key": "HUD_StaggerZY"
				},
				{
					"Source": {
						"Text": "Stagger*: 0.0m"
					},
					"Translation": {
						"Text": "Przesunięcie*: 0.0m"
					},
					"Key": "HUD_StaggerDefault"
				},
				{
					"Source": {
						"Text": "Steps"
					},
					"Translation": {
						"Text": "Stopnie"
					},
					"Key": "Hint_Steps"
				},
				{
					"Source": {
						"Text": "Steps"
					},
					"Translation": {
						"Text": "Stopnie"
					},
					"Key": "Panel_Restore_CaptureSteps"
				},
				{
					"Source": {
						"Text": "Steps"
					},
					"Translation": {
						"Text": "Stopnie"
					},
					"Key": "Panel_Section_Steps"
				},
				{
					"Source": {
						"Text": "Steps [X]:"
					},
					"Translation": {
						"Text": "Stopnie [X]:"
					},
					"Key": "Panel_StepsX"
				},
				{
					"Source": {
						"Text": "Steps [X]{0}: {1}m columns"
					},
					"Translation": {
						"Text": "Schody [X]{0}: {1}m kolumny"
					},
					"Key": "HUD_StepsX"
				},
				{
					"Source": {
						"Text": "Steps [Y]:"
					},
					"Translation": {
						"Text": "Stopnie [Y]:"
					},
					"Key": "Panel_StepsY"
				},
				{
					"Source": {
						"Text": "Steps [Y]{0}: {1}m rows"
					},
					"Translation": {
						"Text": "Schody [Y]{0}: {1}m rzędy"
					},
					"Key": "HUD_StepsY"
				},
				{
					"Source": {
						"Text": "Steps*: 0.0m"
					},
					"Translation": {
						"Text": "Schody*: 0.0m"
					},
					"Key": "HUD_StepsDefault"
				},
				{
					"Source": {
						"Text": "Straight"
					},
					"Translation": {
						"Text": "Prosta"
					},
					"Key": "Walk_Opt_Straight"
				},
				{
					"Source": {
						"Text": "Target Tier:"
					},
					"Translation": {
						"Text": "Docelowy poziom:"
					},
					"Key": "Upgrade_TargetTier"
				},
				{
					"Source": {
						"Text": "Target is not upgradeable - aim at a belt, pipe, or power pole"
					},
					"Translation": {
						"Text": "Cel nie jest ulepszalny — wyceluj w taśmę, rurę lub słup"
					},
					"Key": "Upgrade_NotUpgradeable"
				},
				{
					"Source": {
						"Text": "The on-screen Smart! overlay shown while you build."
					},
					"Translation": {
						"Text": "Ekranowa nakładka Smart! wyświetlana podczas budowania."
					},
					"Key": "Sec.HUD.TT"
				},
				{
					"Source": {
						"Text": "Tier"
					},
					"Translation": {
						"Text": "Poziom"
					},
					"Key": "Walk_Lbl_Tier"
				},
				{
					"Source": {
						"Text": "To Building"
					},
					"Translation": {
						"Text": "Do budynku"
					},
					"Key": "P.PipeLevelToBuilding"
				},
				{
					"Source": {
						"Text": "To Building:"
					},
					"Translation": {
						"Text": "Do budynku:"
					},
					"Key": "Panel_AC_ToBuilding"
				},
				{
					"Source": {
						"Text": "To Building:"
					},
					"Translation": {
						"Text": "Do budynku:"
					},
					"Key": "Config_PipeToBuilding"
				},
				{
					"Source": {
						"Text": "Turn"
					},
					"Translation": {
						"Text": "Skręt"
					},
					"Key": "Walk_Col_Turn"
				},
				{
					"Source": {
						"Text": "Turn{0}: {1}°"
					},
					"Translation": {
						"Text": "Skręt{0}: {1}°"
					},
					"Key": "HUD_WalkTurn"
				},
				{
					"Source": {
						"Text": "UPGRADE"
					},
					"Translation": {
						"Text": "ULEPSZ"
					},
					"Key": "Upgrade_Btn_Upgrade"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "Nieznane"
					},
					"Key": "Family_Unknown"
				},
				{
					"Source": {
						"Text": "Update"
					},
					"Translation": {
						"Text": "Aktualizuj"
					},
					"Key": "Panel_Btn_UpdatePreset"
				},
				{
					"Source": {
						"Text": "Upgrade Panel"
					},
					"Translation": {
						"Text": "Panel ulepszeń"
					},
					"Key": "Hint_UpgradePanel"
				},
				{
					"Source": {
						"Text": "Upgrade cancelled: {0}/{1} completed"
					},
					"Translation": {
						"Text": "Ulepszenie anulowane: {0}/{1} ukończonych"
					},
					"Key": "Upgrade_Cancelled"
				},
				{
					"Source": {
						"Text": "Upgrade complete: {0} success, {1} failed, {2} skipped"
					},
					"Translation": {
						"Text": "Ulepszenie zakończone: {0} sukces, {1} niepowodzenie, {2} pominięte"
					},
					"Key": "Upgrade_Complete"
				},
				{
					"Source": {
						"Text": "Upgrading {0} Mk.{1} → Mk.{2}..."
					},
					"Translation": {
						"Text": "Ulepszanie {0} Mk.{1} → Mk.{2}..."
					},
					"Key": "Upgrade_Upgrading"
				},
				{
					"Source": {
						"Text": "Upgrading... {0}/{1} ({2}%)"
					},
					"Translation": {
						"Text": "Ulepszanie... {0}/{1} ({2}%)"
					},
					"Key": "Upgrade_ProgressCount"
				},
				{
					"Source": {
						"Text": "Use Manifold Lane Belts"
					},
					"Translation": {
						"Text": "Użyj taśm rozdzielacza"
					},
					"Key": "P.bAutoConnectDistributors"
				},
				{
					"Source": {
						"Text": "Use Manifold Lane Belts:"
					},
					"Translation": {
						"Text": "Taśmy rozdzielacza:"
					},
					"Key": "Config_ManifoldLaneBelts"
				},
				{
					"Source": {
						"Text": "Vertical position of the HUD on screen (0 = top, 1 = bottom)."
					},
					"Translation": {
						"Text": "Pionowa pozycja HUD na ekranie (0 = góra, 1 = dół)."
					},
					"Key": "P.HUDPositionY.TT"
				},
				{
					"Source": {
						"Text": "Wall Outlet Mk.{0}"
					},
					"Translation": {
						"Text": "Ścienny rozdzielacz Mk.{0}"
					},
					"Key": "UpgradeRow_WallOutlet"
				},
				{
					"Source": {
						"Text": "Wall Outlets (Double)"
					},
					"Translation": {
						"Text": "Gniazda ścienne (dwustronne)"
					},
					"Key": "Family_WallOutletDouble"
				},
				{
					"Source": {
						"Text": "Wall Outlets (Single)"
					},
					"Translation": {
						"Text": "Gniazda ścienne (jednostronne)"
					},
					"Key": "Family_WallOutletSingle"
				},
				{
					"Source": {
						"Text": "When you Extend a factory that has no power pole and no existing daisy link (starting a fresh manifold), wire the new buildings together with daisy-chain power. Factories already daisy-chained are always continued regardless of this option."
					},
					"Translation": {
						"Text": "Gdy rozszerzasz fabrykę, która nie ma słupa energetycznego ani istniejącego połączenia łańcuchowego (rozpoczynając nowy kolektor), połącz nowe budynki łańcuchowym zasilaniem. Fabryki już połączone łańcuchowo są zawsze kontynuowane niezależnie od tej opcji."
					},
					"Key": "P.bExtendDaisyChainPoleless.TT"
				},
				{
					"Source": {
						"Text": "Which directions power poles connect: Auto, X only, Y only, or both X and Y."
					},
					"Translation": {
						"Text": "W których kierunkach łączą się słupy energetyczne: Auto, tylko X, tylko Y lub X i Y."
					},
					"Key": "P.PowerConnectMode.TT"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": "X"
					},
					"Key": "Upgrade_Btn_X"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": "X"
					},
					"Key": "ArrowLabel_X"
				},
				{
					"Source": {
						"Text": "Y"
					},
					"Translation": {
						"Text": "Y"
					},
					"Key": "ArrowLabel_Y"
				},
				{
					"Source": {
						"Text": "You are about to generate {0} holograms.\\n\\nThis may cause a temporary freeze.\\n\\nContinue?"
					},
					"Translation": {
						"Text": "Zamierzasz wygenerować {0} hologramów.\\n\\nTo może spowodować tymczasowe zawieszenie.\\n\\nKontynuować?"
					},
					"Key": "Panel_Confirm_LargeMsg"
				},
				{
					"Source": {
						"Text": "You are about to generate {0} holograms.\\n\\nThis will likely cause a significant freeze and may crash the game.\\n\\nAre you sure you want to continue?"
					},
					"Translation": {
						"Text": "Zamierzasz wygenerować {0} hologramów.\\n\\nTo prawdopodobnie spowoduje znaczne zawieszenie i może zawiesić grę.\\n\\nCzy na pewno chcesz kontynuować?"
					},
					"Key": "Panel_Confirm_ExtremeMsg"
				},
				{
					"Source": {
						"Text": "Z"
					},
					"Translation": {
						"Text": "Z"
					},
					"Key": "ArrowLabel_Z"
				},
				{
					"Source": {
						"Text": "[INVALID]"
					},
					"Translation": {
						"Text": "[NIEPRAWIDŁOWY]"
					},
					"Key": "HUD_Invalid"
				},
				{
					"Source": {
						"Text": "apply immediately"
					},
					"Translation": {
						"Text": "zastosuj natychmiast"
					},
					"Key": "Walk_ApplyImmediately"
				},
				{
					"Source": {
						"Text": "belt"
					},
					"Translation": {
						"Text": "taśma"
					},
					"Key": "HUD_Walk_Belt"
				},
				{
					"Source": {
						"Text": "m"
					},
					"Translation": {
						"Text": "m"
					},
					"Key": "Panel_Unit_Meters"
				},
				{
					"Source": {
						"Text": "pipe"
					},
					"Translation": {
						"Text": "rura"
					},
					"Key": "HUD_Walk_Pipe"
				},
				{
					"Source": {
						"Text": "segment {0} too long ({1}m > 56m)"
					},
					"Translation": {
						"Text": "segment {0} za długi ({1}m > 56m)"
					},
					"Key": "Walk_Invalid_TooLong"
				},
				{
					"Source": {
						"Text": "segment {0} too steep ({1}deg > 30deg)"
					},
					"Translation": {
						"Text": "segment {0} za stromy ({1}° > 30°)"
					},
					"Key": "Walk_Invalid_TooSteep"
				},
				{
					"Source": {
						"Text": "{0} Mk.{1}: No valid upgrade target selected"
					},
					"Translation": {
						"Text": "{0} Mk.{1}: Nie wybrano prawidłowego celu ulepszenia"
					},
					"Key": "Upgrade_NoValidTarget"
				},
				{
					"Source": {
						"Text": "{0} [LIMIT HIT]"
					},
					"Translation": {
						"Text": "{0} [LIMIT OSIĄGNIĘTY]"
					},
					"Key": "Upgrade_FoundItemsLimit"
				},
				{
					"Source": {
						"Text": "{0} items → Mk.{1}\n"
					},
					"Translation": {
						"Text": "{0} elementów → Mk.{1}\\n"
					},
					"Key": "Upgrade_CostItems"
				},
				{
					"Source": {
						"Text": "{0} {0}|plural(one=segment,other=segments)  ·  head {1} {2} deg  ·  {3}"
					},
					"Translation": {
						"Text": "{0} {0}|plural(one=segment,few=segmenty,many=segmentów,other=segmentu)  ·  kurs {1} {2} deg  ·  {3}"
					},
					"Key": "Walk_Summary"
				},
				{
					"Source": {
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\n"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Upgrade_CostHeader"
				},
				{
					"Source": {
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\n(Cost unavailable)"
					},
					"Translation": {
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\\n(Koszt niedostępny)"
					},
					"Key": "Upgrade_CostUnavailable"
				},
				{
					"Source": {
						"Text": "‹ Scaling"
					},
					"Translation": {
						"Text": "‹ Skalowanie"
					},
					"Key": "Walk_Btn_Scaling"
				},
				{
					"Source": {
						"Text": "← Input: {0} x{1} ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "← Wejście: {0} x{1} ({2}/min) (Suma siatki: {3}/min)"
					},
					"Key": "Panel_Recipe_Input"
				},
				{
					"Source": {
						"Text": "← Input: {0} x{1} m³ ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "← Wejście: {0} x{1} m³ ({2}/min) (Suma siatki: {3}/min)"
					},
					"Key": "Panel_Recipe_InputLiquid"
				},
				{
					"Source": {
						"Text": "→ Output: {0} x{1} ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "→ Wyjście: {0} x{1} ({2}/min) (Suma siatki: {3}/min)"
					},
					"Key": "Panel_Recipe_Output"
				},
				{
					"Source": {
						"Text": "→ Output: {0} x{1} m³ ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "→ Wyjście: {0} x{1} m³ ({2}/min) (Suma siatki: {3}/min)"
					},
					"Key": "Panel_Recipe_OutputLiquid"
				}
			]
		}
	]
}